Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz2025dab288.h
extern volatile __IPC30bits_t IPC30bits __asm__ ("IPC30") __attribute__((section("sfrs"), address(0xBF810320)));
extern volatile uint32_t        IPC30CLR __attribute__((section("sfrs"),address(0xBF810324)));
extern volatile uint32_t        IPC30SET __attribute__((section("sfrs"),address(0xBF810328)));
extern volatile uint32_t        IPC30INV __attribute__((section("sfrs"),address(0xBF81032C)));
#define IPC31 IPC31
extern volatile uint32_t   IPC31 __attribute__((section("sfrs"), address(0xBF810330)));
typedef union {
  struct {
    uint32_t CNGIS:2;
    uint32_t CNGIP:3;
    uint32_t :3;
    uint32_t CNHIS:2;
    uint32_t CNHIP:3;
    uint32_t :3;
    uint32_t CNJIS:2;
    uint32_t CNJIP:3;
    uint32_t :3;
    uint32_t CNKIS:2;
    uint32_t CNKIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC31bits_t;
extern volatile __IPC31bits_t IPC31bits __asm__ ("IPC31") __attribute__((section("sfrs"), address(0xBF810330)));
extern volatile uint32_t        IPC31CLR __attribute__((section("sfrs"),address(0xBF810334)));
extern volatile uint32_t        IPC31SET __attribute__((section("sfrs"),address(0xBF810338)));
extern volatile uint32_t        IPC31INV __attribute__((section("sfrs"),address(0xBF81033C)));
#define IPC32 IPC32
extern volatile uint32_t   IPC32 __attribute__((section("sfrs"), address(0xBF810340)));
typedef union {
  struct {
    uint32_t PMPIS:2;
    uint32_t PMPIP:3;
    uint32_t :3;
    uint32_t PMPEIS:2;
    uint32_t PMPEIP:3;
    uint32_t :3;
    uint32_t CMP1IS:2;
    uint32_t CMP1IP:3;
    uint32_t :3;
    uint32_t CMP2IS:2;
    uint32_t CMP2IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC32bits_t;
extern volatile __IPC32bits_t IPC32bits __asm__ ("IPC32") __attribute__((section("sfrs"), address(0xBF810340)));
extern volatile uint32_t        IPC32CLR __attribute__((section("sfrs"),address(0xBF810344)));
extern volatile uint32_t        IPC32SET __attribute__((section("sfrs"),address(0xBF810348)));
extern volatile uint32_t        IPC32INV __attribute__((section("sfrs"),address(0xBF81034C)));
#define IPC33 IPC33
extern volatile uint32_t   IPC33 __attribute__((section("sfrs"), address(0xBF810350)));
typedef union {
  struct {
    uint32_t USBIS:2;
    uint32_t USBIP:3;
    uint32_t :3;
    uint32_t USBDMAIS:2;
    uint32_t USBDMAIP:3;
    uint32_t :3;
    uint32_t DMA0IS:2;
    uint32_t DMA0IP:3;
    uint32_t :3;
    uint32_t DMA1IS:2;
    uint32_t DMA1IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC33bits_t;
extern volatile __IPC33bits_t IPC33bits __asm__ ("IPC33") __attribute__((section("sfrs"), address(0xBF810350)));
extern volatile uint32_t        IPC33CLR __attribute__((section("sfrs"),address(0xBF810354)));
extern volatile uint32_t        IPC33SET __attribute__((section("sfrs"),address(0xBF810358)));
extern volatile uint32_t        IPC33INV __attribute__((section("sfrs"),address(0xBF81035C)));
#define IPC34 IPC34
extern volatile uint32_t   IPC34 __attribute__((section("sfrs"), address(0xBF810360)));
typedef union {
  struct {
    uint32_t DMA2IS:2;
    uint32_t DMA2IP:3;
    uint32_t :3;
    uint32_t DMA3IS:2;
    uint32_t DMA3IP:3;
    uint32_t :3;
    uint32_t DMA4IS:2;
    uint32_t DMA4IP:3;
    uint32_t :3;
    uint32_t DMA5IS:2;
    uint32_t DMA5IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC34bits_t;
extern volatile __IPC34bits_t IPC34bits __asm__ ("IPC34") __attribute__((section("sfrs"), address(0xBF810360)));
extern volatile uint32_t        IPC34CLR __attribute__((section("sfrs"),address(0xBF810364)));
extern volatile uint32_t        IPC34SET __attribute__((section("sfrs"),address(0xBF810368)));
extern volatile uint32_t        IPC34INV __attribute__((section("sfrs"),address(0xBF81036C)));
#define IPC35 IPC35
extern volatile uint32_t   IPC35 __attribute__((section("sfrs"), address(0xBF810370)));
typedef union {
  struct {
    uint32_t DMA6IS:2;
    uint32_t DMA6IP:3;
    uint32_t :3;
    uint32_t DMA7IS:2;
    uint32_t DMA7IP:3;
    uint32_t :3;
    uint32_t SPI2EIS:2;
    uint32_t SPI2EIP:3;
    uint32_t :3;
    uint32_t SPI2RXIS:2;
    uint32_t SPI2RXIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC35bits_t;
extern volatile __IPC35bits_t IPC35bits __asm__ ("IPC35") __attribute__((section("sfrs"), address(0xBF810370)));
extern volatile uint32_t        IPC35CLR __attribute__((section("sfrs"),address(0xBF810374)));
extern volatile uint32_t        IPC35SET __attribute__((section("sfrs"),address(0xBF810378)));
extern volatile uint32_t        IPC35INV __attribute__((section("sfrs"),address(0xBF81037C)));
#define IPC36 IPC36
extern volatile uint32_t   IPC36 __attribute__((section("sfrs"), address(0xBF810380)));
typedef union {
  struct {
    uint32_t SPI2TXIS:2;
    uint32_t SPI2TXIP:3;
    uint32_t :3;
    uint32_t U2EIS:2;
    uint32_t U2EIP:3;
    uint32_t :3;
    uint32_t U2RXIS:2;
    uint32_t U2RXIP:3;
    uint32_t :3;
    uint32_t U2TXIS:2;
    uint32_t U2TXIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC36bits_t;
extern volatile __IPC36bits_t IPC36bits __asm__ ("IPC36") __attribute__((section("sfrs"), address(0xBF810380)));
extern volatile uint32_t        IPC36CLR __attribute__((section("sfrs"),address(0xBF810384)));
extern volatile uint32_t        IPC36SET __attribute__((section("sfrs"),address(0xBF810388)));
extern volatile uint32_t        IPC36INV __attribute__((section("sfrs"),address(0xBF81038C)));
#define IPC37 IPC37
extern volatile uint32_t   IPC37 __attribute__((section("sfrs"), address(0xBF810390)));
typedef union {
  struct {
    uint32_t I2C2BIS:2;
    uint32_t I2C2BIP:3;
    uint32_t :3;
    uint32_t I2C2SIS:2;
    uint32_t I2C2SIP:3;
    uint32_t :3;
    uint32_t I2C2MIS:2;
    uint32_t I2C2MIP:3;
    uint32_t :3;
    uint32_t CAN1IS:2;
    uint32_t CAN1IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC37bits_t;
extern volatile __IPC37bits_t IPC37bits __asm__ ("IPC37") __attribute__((section("sfrs"), address(0xBF810390)));
extern volatile uint32_t        IPC37CLR __attribute__((section("sfrs"),address(0xBF810394)));
extern volatile uint32_t        IPC37SET __attribute__((section("sfrs"),address(0xBF810398)));
extern volatile uint32_t        IPC37INV __attribute__((section("sfrs"),address(0xBF81039C)));
#define IPC38 IPC38
extern volatile uint32_t   IPC38 __attribute__((section("sfrs"), address(0xBF8103A0)));
typedef union {
  struct {
    uint32_t CAN2IS:2;
    uint32_t CAN2IP:3;
    uint32_t :3;
    uint32_t ETHIS:2;
    uint32_t ETHIP:3;
    uint32_t :3;
    uint32_t SPI3EIS:2;
    uint32_t SPI3EIP:3;
    uint32_t :3;
    uint32_t SPI3RXIS:2;
    uint32_t SPI3RXIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC38bits_t;
