Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz2025dab288.h
extern volatile __DDRMINLIMbits_t DDRMINLIMbits __asm__ ("DDRMINLIM") __attribute__((section("sfrs"), address(0xBF8E8004)));
#define DDRRQPER DDRRQPER
extern volatile uint32_t   DDRRQPER __attribute__((section("sfrs"), address(0xBF8E8008)));
typedef struct {
  uint32_t RQPER:8;
} __DDRRQPERbits_t;
extern volatile __DDRRQPERbits_t DDRRQPERbits __asm__ ("DDRRQPER") __attribute__((section("sfrs"), address(0xBF8E8008)));
#define DDRMINCMD DDRMINCMD
extern volatile uint32_t   DDRMINCMD __attribute__((section("sfrs"), address(0xBF8E800C)));
typedef struct {
  uint32_t MINCMD:8;
} __DDRMINCMDbits_t;
extern volatile __DDRMINCMDbits_t DDRMINCMDbits __asm__ ("DDRMINCMD") __attribute__((section("sfrs"), address(0xBF8E800C)));
#define DDRMEMCON DDRMEMCON
extern volatile uint32_t   DDRMEMCON __attribute__((section("sfrs"), address(0xBF8E8010)));
typedef struct {
  uint32_t STINIT:1;
  uint32_t INITDN:1;
} __DDRMEMCONbits_t;
extern volatile __DDRMEMCONbits_t DDRMEMCONbits __asm__ ("DDRMEMCON") __attribute__((section("sfrs"), address(0xBF8E8010)));
#define DDRMEMCFG0 DDRMEMCFG0
extern volatile uint32_t   DDRMEMCFG0 __attribute__((section("sfrs"), address(0xBF8E8014)));
typedef struct {
  uint32_t RWADDR:5;
  uint32_t :3;
  uint32_t BNKADDR:5;
  uint32_t :3;
  uint32_t CSADDR:5;
  uint32_t :3;
  uint32_t CLHADDR:5;
  uint32_t :1;
  uint32_t APCHRGEN:1;
} __DDRMEMCFG0bits_t;
extern volatile __DDRMEMCFG0bits_t DDRMEMCFG0bits __asm__ ("DDRMEMCFG0") __attribute__((section("sfrs"), address(0xBF8E8014)));
#define DDRMEMCFG1 DDRMEMCFG1
extern volatile uint32_t   DDRMEMCFG1 __attribute__((section("sfrs"), address(0xBF8E8018)));
typedef struct {
  uint32_t RWADDRMSK:13;
} __DDRMEMCFG1bits_t;
extern volatile __DDRMEMCFG1bits_t DDRMEMCFG1bits __asm__ ("DDRMEMCFG1") __attribute__((section("sfrs"), address(0xBF8E8018)));
#define DDRMEMCFG2 DDRMEMCFG2
extern volatile uint32_t   DDRMEMCFG2 __attribute__((section("sfrs"), address(0xBF8E801C)));
typedef struct {
  uint32_t CLADDRHMSK:13;
} __DDRMEMCFG2bits_t;
extern volatile __DDRMEMCFG2bits_t DDRMEMCFG2bits __asm__ ("DDRMEMCFG2") __attribute__((section("sfrs"), address(0xBF8E801C)));
#define DDRMEMCFG3 DDRMEMCFG3
extern volatile uint32_t   DDRMEMCFG3 __attribute__((section("sfrs"), address(0xBF8E8020)));
typedef struct {
  uint32_t CLADDRLMSK:13;
} __DDRMEMCFG3bits_t;
extern volatile __DDRMEMCFG3bits_t DDRMEMCFG3bits __asm__ ("DDRMEMCFG3") __attribute__((section("sfrs"), address(0xBF8E8020)));
#define DDRMEMCFG4 DDRMEMCFG4
extern volatile uint32_t   DDRMEMCFG4 __attribute__((section("sfrs"), address(0xBF8E8024)));
typedef struct {
  uint32_t BNKADDRMSK:5;
  uint32_t :3;
  uint32_t CSADDRMSK:5;
} __DDRMEMCFG4bits_t;
extern volatile __DDRMEMCFG4bits_t DDRMEMCFG4bits __asm__ ("DDRMEMCFG4") __attribute__((section("sfrs"), address(0xBF8E8024)));
#define DDRREFCFG DDRREFCFG
extern volatile uint32_t   DDRREFCFG __attribute__((section("sfrs"), address(0xBF8E8028)));
typedef struct {
  uint32_t REFCNT:16;
  uint32_t REFDLY:8;
  uint32_t MAXREFS:3;
} __DDRREFCFGbits_t;
extern volatile __DDRREFCFGbits_t DDRREFCFGbits __asm__ ("DDRREFCFG") __attribute__((section("sfrs"), address(0xBF8E8028)));
#define DDRPWRCFG DDRPWRCFG
extern volatile uint32_t   DDRPWRCFG __attribute__((section("sfrs"), address(0xBF8E802C)));
typedef struct {
  uint32_t :2;
  uint32_t APWRDNEN:1;
  uint32_t ASLFREFEN:1;
  uint32_t PWRDNDLY:8;
  uint32_t SLFREFDLY:10;
  uint32_t PCHRGPWRDN:1;
} __DDRPWRCFGbits_t;
extern volatile __DDRPWRCFGbits_t DDRPWRCFGbits __asm__ ("DDRPWRCFG") __attribute__((section("sfrs"), address(0xBF8E802C)));
#define DDRDLYCFG0 DDRDLYCFG0
extern volatile uint32_t   DDRDLYCFG0 __attribute__((section("sfrs"), address(0xBF8E8030)));
typedef struct {
  uint32_t W2RDLY:4;
  uint32_t W2RCSDLY:4;
  uint32_t R2RDLY:4;
  uint32_t R2RCSDLY:4;
  uint32_t W2WDLY:4;
  uint32_t W2WCSDLY:4;
  uint32_t R2WDLY:4;
  uint32_t RMWDLY:4;
} __DDRDLYCFG0bits_t;
extern volatile __DDRDLYCFG0bits_t DDRDLYCFG0bits __asm__ ("DDRDLYCFG0") __attribute__((section("sfrs"), address(0xBF8E8030)));
#define DDRDLYCFG1 DDRDLYCFG1
extern volatile uint32_t   DDRDLYCFG1 __attribute__((section("sfrs"), address(0xBF8E8034)));
typedef struct {
  uint32_t SLFREFMINDLY:8;
  uint32_t SLFREFEXDLY:8;
  uint32_t PWRDNMINDLY:4;
  uint32_t PWRDNEXDLY:6;
  uint32_t W2PCHRGDLY4:1;
  uint32_t W2RDLY4:1;
  uint32_t W2RCSDLY4:1;
  uint32_t NXTDATAVDLY4:1;
  uint32_t SLFREFEXDLY8:1;
} __DDRDLYCFG1bits_t;
extern volatile __DDRDLYCFG1bits_t DDRDLYCFG1bits __asm__ ("DDRDLYCFG1") __attribute__((section("sfrs"), address(0xBF8E8034)));
#define DDRDLYCFG2 DDRDLYCFG2
extern volatile uint32_t   DDRDLYCFG2 __attribute__((section("sfrs"), address(0xBF8E8038)));
typedef struct {
  uint32_t PCHRGALLDLY:4;
  uint32_t :4;
  uint32_t R2PCHRGDLY:4;
  uint32_t W2PCHRGDLY:4;
  uint32_t RAS2RASDLY:4;
  uint32_t RAS2CASDLY:4;
  uint32_t PCHRG2RASDLY:4;
  uint32_t RBENDDLY:4;
} __DDRDLYCFG2bits_t;
extern volatile __DDRDLYCFG2bits_t DDRDLYCFG2bits __asm__ ("DDRDLYCFG2") __attribute__((section("sfrs"), address(0xBF8E8038)));
#define DDRDLYCFG3 DDRDLYCFG3
extern volatile uint32_t   DDRDLYCFG3 __attribute__((section("sfrs"), address(0xBF8E803C)));
typedef struct {
  uint32_t RAS2PCHRGDLY:5;
  uint32_t :3;
  uint32_t RAS2RASSBNKDLY:6;
  uint32_t :2;
  uint32_t FAWTDLY:6;
} __DDRDLYCFG3bits_t;
extern volatile __DDRDLYCFG3bits_t DDRDLYCFG3bits __asm__ ("DDRDLYCFG3") __attribute__((section("sfrs"), address(0xBF8E803C)));
#define DDRODTCFG DDRODTCFG
extern volatile uint32_t   DDRODTCFG __attribute__((section("sfrs"), address(0xBF8E8040)));
typedef struct {
  uint32_t ODTCSEN:8;
  uint32_t ODTRDLY:4;
  uint32_t ODTWDLY:4;
  uint32_t ODTRLEN:3;
  uint32_t :1;
  uint32_t ODTWLEN:3;
} __DDRODTCFGbits_t;
extern volatile __DDRODTCFGbits_t DDRODTCFGbits __asm__ ("DDRODTCFG") __attribute__((section("sfrs"), address(0xBF8E8040)));
#define DDRXFERCFG DDRXFERCFG
extern volatile uint32_t   DDRXFERCFG __attribute__((section("sfrs"), address(0xBF8E8044)));
typedef struct {
  uint32_t NXTDATRQDLY:4;
  uint32_t NXTDATAVDLY:4;
  uint32_t :8;
  uint32_t RDATENDLY:4;
  uint32_t :4;
  uint32_t MAXBURST:4;
  uint32_t :3;
  uint32_t BIGENDIAN:1;
} __DDRXFERCFGbits_t;
extern volatile __DDRXFERCFGbits_t DDRXFERCFGbits __asm__ ("DDRXFERCFG") __attribute__((section("sfrs"), address(0xBF8E8044)));
#define DDRCMDISSUE DDRCMDISSUE
extern volatile uint32_t   DDRCMDISSUE __attribute__((section("sfrs"), address(0xBF8E8048)));
typedef struct {
  uint32_t NUMHOSTCMDS:4;
  uint32_t VALID:1;
} __DDRCMDISSUEbits_t;
