Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz2025dab288.h
#define _GLCDCURDATA92_PIXEL233_POSITION         0x00000010
#define _GLCDCURDATA92_PIXEL233_MASK             0x000F0000
#define _GLCDCURDATA92_PIXEL233_LENGTH           0x00000004

#define _GLCDCURDATA92_PIXEL232_POSITION         0x00000014
#define _GLCDCURDATA92_PIXEL232_MASK             0x00F00000
#define _GLCDCURDATA92_PIXEL232_LENGTH           0x00000004

#define _GLCDCURDATA92_PIXEL231_POSITION         0x00000018
#define _GLCDCURDATA92_PIXEL231_MASK             0x0F000000
#define _GLCDCURDATA92_PIXEL231_LENGTH           0x00000004

#define _GLCDCURDATA92_PIXEL230_POSITION         0x0000001C
#define _GLCDCURDATA92_PIXEL230_MASK             0xF0000000
#define _GLCDCURDATA92_PIXEL230_LENGTH           0x00000004

#define _GLCDCURDATA93_PIXEL2315_POSITION        0x00000000
#define _GLCDCURDATA93_PIXEL2315_MASK            0x0000000F
#define _GLCDCURDATA93_PIXEL2315_LENGTH          0x00000004

#define _GLCDCURDATA93_PIXEL2314_POSITION        0x00000004
#define _GLCDCURDATA93_PIXEL2314_MASK            0x000000F0
#define _GLCDCURDATA93_PIXEL2314_LENGTH          0x00000004

#define _GLCDCURDATA93_PIXEL2313_POSITION        0x00000008
#define _GLCDCURDATA93_PIXEL2313_MASK            0x00000F00
#define _GLCDCURDATA93_PIXEL2313_LENGTH          0x00000004

#define _GLCDCURDATA93_PIXEL2312_POSITION        0x0000000C
#define _GLCDCURDATA93_PIXEL2312_MASK            0x0000F000
#define _GLCDCURDATA93_PIXEL2312_LENGTH          0x00000004

#define _GLCDCURDATA93_PIXEL2311_POSITION        0x00000010
#define _GLCDCURDATA93_PIXEL2311_MASK            0x000F0000
#define _GLCDCURDATA93_PIXEL2311_LENGTH          0x00000004

#define _GLCDCURDATA93_PIXEL2310_POSITION        0x00000014
#define _GLCDCURDATA93_PIXEL2310_MASK            0x00F00000
#define _GLCDCURDATA93_PIXEL2310_LENGTH          0x00000004

#define _GLCDCURDATA93_PIXEL239_POSITION         0x00000018
#define _GLCDCURDATA93_PIXEL239_MASK             0x0F000000
#define _GLCDCURDATA93_PIXEL239_LENGTH           0x00000004

#define _GLCDCURDATA93_PIXEL238_POSITION         0x0000001C
#define _GLCDCURDATA93_PIXEL238_MASK             0xF0000000
#define _GLCDCURDATA93_PIXEL238_LENGTH           0x00000004

#define _GLCDCURDATA94_PIXEL2323_POSITION        0x00000000
#define _GLCDCURDATA94_PIXEL2323_MASK            0x0000000F
#define _GLCDCURDATA94_PIXEL2323_LENGTH          0x00000004

#define _GLCDCURDATA94_PIXEL2322_POSITION        0x00000004
#define _GLCDCURDATA94_PIXEL2322_MASK            0x000000F0
#define _GLCDCURDATA94_PIXEL2322_LENGTH          0x00000004

#define _GLCDCURDATA94_PIXEL2321_POSITION        0x00000008
#define _GLCDCURDATA94_PIXEL2321_MASK            0x00000F00
#define _GLCDCURDATA94_PIXEL2321_LENGTH          0x00000004

#define _GLCDCURDATA94_PIXEL2320_POSITION        0x0000000C
#define _GLCDCURDATA94_PIXEL2320_MASK            0x0000F000
#define _GLCDCURDATA94_PIXEL2320_LENGTH          0x00000004

#define _GLCDCURDATA94_PIXEL2319_POSITION        0x00000010
#define _GLCDCURDATA94_PIXEL2319_MASK            0x000F0000
#define _GLCDCURDATA94_PIXEL2319_LENGTH          0x00000004

#define _GLCDCURDATA94_PIXEL2318_POSITION        0x00000014
#define _GLCDCURDATA94_PIXEL2318_MASK            0x00F00000
#define _GLCDCURDATA94_PIXEL2318_LENGTH          0x00000004

#define _GLCDCURDATA94_PIXEL2317_POSITION        0x00000018
#define _GLCDCURDATA94_PIXEL2317_MASK            0x0F000000
#define _GLCDCURDATA94_PIXEL2317_LENGTH          0x00000004

#define _GLCDCURDATA94_PIXEL2316_POSITION        0x0000001C
#define _GLCDCURDATA94_PIXEL2316_MASK            0xF0000000
#define _GLCDCURDATA94_PIXEL2316_LENGTH          0x00000004

#define _GLCDCURDATA95_PIXEL2331_POSITION        0x00000000
#define _GLCDCURDATA95_PIXEL2331_MASK            0x0000000F
#define _GLCDCURDATA95_PIXEL2331_LENGTH          0x00000004

#define _GLCDCURDATA95_PIXEL2330_POSITION        0x00000004
#define _GLCDCURDATA95_PIXEL2330_MASK            0x000000F0
#define _GLCDCURDATA95_PIXEL2330_LENGTH          0x00000004

#define _GLCDCURDATA95_PIXEL2329_POSITION        0x00000008
#define _GLCDCURDATA95_PIXEL2329_MASK            0x00000F00
#define _GLCDCURDATA95_PIXEL2329_LENGTH          0x00000004

#define _GLCDCURDATA95_PIXEL2328_POSITION        0x0000000C
#define _GLCDCURDATA95_PIXEL2328_MASK            0x0000F000
#define _GLCDCURDATA95_PIXEL2328_LENGTH          0x00000004

#define _GLCDCURDATA95_PIXEL2327_POSITION        0x00000010
#define _GLCDCURDATA95_PIXEL2327_MASK            0x000F0000
#define _GLCDCURDATA95_PIXEL2327_LENGTH          0x00000004

#define _GLCDCURDATA95_PIXEL2326_POSITION        0x00000014
#define _GLCDCURDATA95_PIXEL2326_MASK            0x00F00000
#define _GLCDCURDATA95_PIXEL2326_LENGTH          0x00000004

#define _GLCDCURDATA95_PIXEL2325_POSITION        0x00000018
#define _GLCDCURDATA95_PIXEL2325_MASK            0x0F000000
#define _GLCDCURDATA95_PIXEL2325_LENGTH          0x00000004

#define _GLCDCURDATA95_PIXEL2324_POSITION        0x0000001C
#define _GLCDCURDATA95_PIXEL2324_MASK            0xF0000000
#define _GLCDCURDATA95_PIXEL2324_LENGTH          0x00000004

#define _GLCDCURDATA96_PIXEL247_POSITION         0x00000000
#define _GLCDCURDATA96_PIXEL247_MASK             0x0000000F
#define _GLCDCURDATA96_PIXEL247_LENGTH           0x00000004

#define _GLCDCURDATA96_PIXEL246_POSITION         0x00000004
#define _GLCDCURDATA96_PIXEL246_MASK             0x000000F0
#define _GLCDCURDATA96_PIXEL246_LENGTH           0x00000004

#define _GLCDCURDATA96_PIXEL245_POSITION         0x00000008
#define _GLCDCURDATA96_PIXEL245_MASK             0x00000F00
#define _GLCDCURDATA96_PIXEL245_LENGTH           0x00000004

#define _GLCDCURDATA96_PIXEL244_POSITION         0x0000000C
#define _GLCDCURDATA96_PIXEL244_MASK             0x0000F000
#define _GLCDCURDATA96_PIXEL244_LENGTH           0x00000004

#define _GLCDCURDATA96_PIXEL243_POSITION         0x00000010
#define _GLCDCURDATA96_PIXEL243_MASK             0x000F0000
#define _GLCDCURDATA96_PIXEL243_LENGTH           0x00000004

#define _GLCDCURDATA96_PIXEL242_POSITION         0x00000014
#define _GLCDCURDATA96_PIXEL242_MASK             0x00F00000
#define _GLCDCURDATA96_PIXEL242_LENGTH           0x00000004

#define _GLCDCURDATA96_PIXEL241_POSITION         0x00000018
#define _GLCDCURDATA96_PIXEL241_MASK             0x0F000000
#define _GLCDCURDATA96_PIXEL241_LENGTH           0x00000004

#define _GLCDCURDATA96_PIXEL240_POSITION         0x0000001C
#define _GLCDCURDATA96_PIXEL240_MASK             0xF0000000
#define _GLCDCURDATA96_PIXEL240_LENGTH           0x00000004

